notes/meeting_2022jan30.org
* meeting notes January 30, 2022
** the raku study group
*** Don't Raku the boat

** usual links to the meeting material
*** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jan30.md 
*** https://github.com/doomvox/raku-study/bin/2022jan30

** topics

*** darkroast
**** staging area for new roast tests, lower bar to add more tests than to roast

*** alan "psychological issues with learning new langs"
**** https://vickiboykis.com/2021/11/07/the-programmers-brain-in-the-lands-of-exploration-and-production/

*** distinguishing nothings
**** /home/doom/End/Cave/RakuStudy/Notes/Topics/topic-distinguishing_nothings-subsig_feature_missing
**** H. Meijin Brand raises an interesting, but not critical point:
***** can you tell if a sub was passed a value that just happens to match the default?

*** stripping bracketing single-quotes
**** https://www.nntp.perl.org/group/perl.perl6.users/2022/01/msg10421.html

*** played around with flattening
**** the page to read:
***** https://docs.raku.org/language/containers#Flattening,_items_and_containers

*** bruce gray on the weekly challenge (?)
**** https://theweeklychallenge.org/blog/perl-weekly-challenge-149/
**** https://github.com/Util/perlweeklychallenge-club/tree/branch-for-challenge-149/challenge-149/bruce-gray 

**** post (still in progress)
***** http://blogs.perl.org/users/bruce_gray/2022/01/twc-149-limited-fibs-and-bases-of-unusual-size.html

**** post about the last challenge
***** http://blogs.perl.org/users/bruce_gray/2022/01/twc-148-numbrs-and-cubic-cards.html 

**** "Concrete Math" by Donald Knuth
***** the math you'd need to follow art of computer programming
***** bg: fusion of continuous and discrete math 

** topics we didn't get to

*** first programming book discussed:
**** https://cacm.acm.org/magazines/2011/9/122802-in-praise-of-wilkes-wheeler-and-gill/fulltext 

*** a gotcha in writing code to loop over lines from a file
**** https://www.reddit.com/r/rakulang/comments/sb48fy/for_iolines_incredibly_slow/

*** sequences and for loops 
**** https://www.reddit.com/r/rakulang/comments/sbsrjm/sequences_and_for_loops/

*** raiph, in passing points out an oddity of "constant"s
**** https://www.reddit.com/r/rakulang/comments/sd6ls3/rfc_foo_42/hucauoe/

*** lots of perl5 activity 
**** porters list
**** leonerd
***** https://leonerds-code.blogspot.com/2022/01/perl-in-2022-yearly-update.html

**** typed pipes
***** https://vickiboykis.com/2021/11/07/the-programmers-brain-in-the-lands-of-exploration-and-production/
***** issue raised by the parrot raiser


** old topics from last meeting 
*** rob ransbottom (rir) had questions about oop structures where 
**** parents need to know about children
***** the role needs to know about parent
****** the role does the exporting?
****** bruce gray recommends parameterized roles
***** factory pattern or abstract factory pattern

*** raku vs python
**** https://www.reddit.com/r/rakulang/comments/ruyo9j/raku_for_the_the_scientistprogrammer_that_is/
**** um... very interrresting. 

*** getting sets to DWIM
**** https://donaldh.wtf/2021/01/if-sets-would-dwim/

*** jonathan worthington, cro-ing
**** https://raku-advent.blog/2021/12/19/let-it-cro/

*** misc intro raku subjects for future toalks
**** pair input, adverb syntax
**** junctions and hyper operators, etc:
***** Some examples: https://github.com/doomvox/raku-study/bin/2021feb28
****** /home/doom/End/Cave/RakuStudy/Wall/raku-study/bin/2021feb28/hyperism.pl6
****** /home/doom/End/Cave/RakuStudy/Wall/raku-study/bin/2021feb28/hyperism_in_pairs.pl6
****** /home/doom/End/Cave/RakuStudy/Wall/raku-study/bin/2021feb28/reductionism.pl6
***** from my slide for recommended raku talks
****** https://github.com/doomvox/raku-study/blob/main/notes/talks/new_year_raku/Z8-videos_on_raku.org
******* Leon Timmermans, "Raku syntax I miss in other languages', Jun 8, 2021
******* https://www.youtube.com/watch?v=elalwvfmYgk

**** maybe add slides to stash of introductory raku examples (a new github project?)
***** https://github.com/doomvox/raku-study/blob/main//notes/talks/new_year_raku

** announcments 
*** February 13th: next raku study group meeting (most likely)

*** February 5-6: FOSDEM Raku talks
**** https://www.reddit.com/r/rakulang/comments/rsua3p/raku_talks_at_fosdem/

*** June 21-25: tprc: perl/raku conference 
**** https://perlconference.us/tprc-2022-hou/
